# ####################################################################

#  Created by Genus(TM) Synthesis Solution 22.17-s071_1 on Sat Jun 13 16:45:09 +07 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design DatapathPipelined

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports rst]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {inst_from_imem[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {load_data_from_dmem[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {pc_to_imem[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {addr_to_dmem[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_data_to_dmem[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_we_to_dmem[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_we_to_dmem[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_we_to_dmem[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {store_we_to_dmem[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports halt]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_pc[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 3.0 [get_ports {trace_writeback_inst[0]}]
set_max_fanout 15.000 [current_design]
set_max_transition 1.2 [current_design]
